Documents/КСУ_ВнедоходноеПоступлениеСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>КСУ_ВнедоходноеПоступлениеСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИА_СредстваНаФондах</xr:Item>
				<xr:Item>AccumulationRegister.ИА_СредстваВРезервеНаФондах</xr:Item>
				<xr:Item>InformationRegister.ИА_ИсторияСтатусовЗВС</xr:Item>
				<xr:Item>AccumulationRegister.ИА_ЗаказыНаПриобретение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияДочерняя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточникаСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСУ_ИсточникиСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСредств</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИА_Фонды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фонд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИА_ЗаказыНаПриобретение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗП</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выплачено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КСУ_ВнедоходноеПоступлениеСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОстаток();
	ОбновитьВидимостьЭлементов();
	ОбновитьВидимостьКнопкиПроведения();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстаток() Экспорт
	остаток = Объект.СуммаДокумента;
	для каждого стр из Объект.ИА_ЗаказыНаПриобретение Цикл
		остаток = остаток - стр.Сумма;
	КонецЦикла;
	для каждого стр из Объект.ИА_Фонды Цикл
		остаток = остаток - стр.Сумма;
	КонецЦикла;
	
	//Элементы.ДекорацияОстаток.Видимость = остаток<>0;
	//Элементы.ДекорацияОстаток.Заголовок = "Остаток средств к распределению: " + формат(остаток,"ЧДЦ=2; ЧН=");
	Элементы.ОстатокТекст.Видимость = остаток<>0;
	ОстатокТекст = " Остаток средств к распределению: " + формат(остаток,"ЧДЦ=2; ЧН=");
КонецПроцедуры
 
&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	 Элементы.Организация.Видимость = Объект.Организация <> объект.ОрганизацияДочерняя;
	 Элементы.ИА_ФондыПодразделение.Видимость = ИспПодразделения;
	 Элементы.ГруппаЗаказы.Видимость = Объект.ТипИсточникаСредств = ПредопределенноеЗначение("Справочник.КСУ_ИсточникиСредств.ВозвратОтПоставщика");
	 Элементы.Основание.Видимость = ЗначениеЗаполнено(объект.Основание);
	 
	 Элементы.ГруппаЦентр.ТолькоПросмотр = объект.Проведен;
	 Элементы.ИА_Фонды.КоманднаяПанель.Доступность = не объект.Проведен;
	 Элементы.ИА_ЗаказыНаПриобретение.КоманднаяПанель.Доступность = не объект.Проведен;
	 
	 Элементы.ОрганизацияДочерняя.ТолькоПросмотр = объект.ИА_ЗаказыНаПриобретение.Количество()>0;
	 Элементы.ТипИсточникаСредств.ТолькоПросмотр = объект.ИА_ЗаказыНаПриобретение.Количество()>0;
	 Элементы.Дата.ТолькоПросмотр = объект.ИА_ЗаказыНаПриобретение.Количество()>0;
	 
	 ЕстьОснование = ЗначениеЗаполнено(объект.Основание);
	 //Элементы.Организация.ТолькоПросмотр = ЕстьОснование;
	 Если ЕстьОснование тогда
	 	Элементы.ОрганизацияДочерняя.ТолькоПросмотр = истина;
	 	Элементы.Сумма.ТолькоПросмотр = истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияДочерняяПриИзменении(Элемент)
	Если ИспользуютсяГруппыКомпаний Тогда
		Объект.Организация = ИА_ФП.ПолучитьГоловнуюОрганизацию(Объект.ОрганизацияДочерняя);
	Иначе
		объект.Организация = объект.ОрганизацияДочерняя;
	КонецЕсли;
	ОбновитьВидимостьЭлементов();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользуютсяГруппыКомпаний = Справочники.ИА_ГруппыКомпаний.ПолучитьПризнакИспользованияГруппКомпаний();
	ИспПодразделения = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	ПоОрг = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	
	Элементы.УстановитьПометкуУдаления.Видимость = не объект.Ссылка.Пустая();
	Если ПоОрг тогда
		Элементы.ОрганизацияДочерняя.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() тогда
		объект.Дата = ТекущаяДата();
		объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТипИсточникаСредствПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры


&НаКлиенте
Процедура ИА_ЗаказыНаПриобретениеСуммаПриИзменении(Элемент)
	тд = Элементы.ИА_ЗаказыНаПриобретение.ТекущиеДанные;
	Если тд.Сумма > тд.Выплачено тогда
		Сообщить("Нельзя по заказу вернуть денежных средств от поставщика больше, чем было оплачено!");
		тд.Сумма = тд.Выплачено;
	КонецЕсли;
	
	ОбновитьОстаток();
КонецПроцедуры


&НаКлиенте
Процедура ИА_ФондыСуммаПриИзменении(Элемент)
	ОбновитьОстаток();
КонецПроцедуры


&НаКлиенте
Процедура ИА_ЗаказыНаПриобретениеПослеУдаления(Элемент)
	ОбновитьОстаток();
	ОбновитьВидимостьЭлементов();
КонецПроцедуры


&НаКлиенте
Процедура ИА_ФондыПослеУдаления(Элемент)
	ОбновитьОстаток();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если объект.Дата > КонецДня(ТекущаяДата()) ТОгда		
			ПоказатьПредупреждение(,"Внедоходное поступление можно сохранять как черновик с датой будущего периода. Но утверждать можно не позднее текущей даты (сегодняшней даты). Измените дату и повторите операцию, если вы действительно решили утвердить Внедоходное поступление.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;        
		
		Если объект.СуммаДокумента = 0 Тогда
			ПоказатьПредупреждение(,"Поле ""Сумма к распределению"" не заполнено!");
			Отказ = Истина;
			возврат;
		КонецЕсли;
		
		Если объект.Организация.Пустая() Тогда
			ПоказатьПредупреждение(,"Поле ""Организация"" не заполнено!");
			Отказ = Истина;
			возврат;
		КонецЕсли;
		
		Если остаток > 0 Тогда
			ПоказатьПредупреждение(,"Распределите всю сумму!");
			Отказ = Истина;
			возврат;
		КонецЕсли;
		
		Если остаток < 0 Тогда
			ПоказатьПредупреждение(,"По фондам и заказам распределена сумма, превышающая сумму документа!");
			Отказ = Истина;
			возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения или ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ИА_ФПСервер.естьБудущиеДоки(Объект.организация, Объект.дата) Тогда
			отказ = Истина;
			парамФ_1 = Новый структура("Период, Организация, ИмяДока, Действие", объект.Дата, объект.Организация, "ВДПС");
			парамФ_1.Действие = ?(ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения, "отмены", "проведения");
			ОткрытьФорму("ОбщаяФорма.КСУ_ПредупреждениеПриОтменеПроведения", парамФ_1, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьВидимостьЭлементов();
	ОбновитьВидимостьКнопкиПроведения();
КонецПроцедуры


&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ОбновитьОстаток();
КонецПроцедуры


&НаКлиенте
Процедура ИА_ЗаказыНаПриобретениеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина;
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьЗаказ(Команда)
	Если ПоОрг и объект.Организация.Пустая() Тогда
		ПоказатьПредупреждение(,"Выберите Организацию!");
		возврат;
	КонецЕсли;
	
	ИсклЗаказы = новый массив;
	Для каждого стр из объект.ИА_ЗаказыНаПриобретение Цикл
		ИсклЗаказы.Добавить(стр.ЗП);
	КонецЦикла;
	
	Парам = Новый Структура("Организация,Дата,ИсклЗаказы", объект.ОрганизацияДочерняя, ?(объект.Дата=Дата(1,1,1), ТекущаяДата(), объект.Дата),ИсклЗаказы);
	Оп = Новый ОписаниеОповещения("ЗавершениеВыбораЗаказа", ЭтотОбъект);
	ОткрытьФорму("Документ.КСУ_ВнедоходноеПоступлениеСредств.Форма.ПодборОплаченногоЗаказа", Парам, ЭтаФорма,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораЗаказа(выбЗн, дп) Экспорт
	Если выбЗн <> Неопределено Тогда
		новстр = Объект.ИА_ЗаказыНаПриобретение.Добавить();
		ЗаполнитьЗначенияСвойств(новстр, выбЗн);
		новстр.Сумма = новстр.Выплачено;
		
		ОбновитьОстаток();
		ОбновитьВидимостьЭлементов();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ИА_ЗаказыНаПриобретениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	тд = Элементы.ИА_ЗаказыНаПриобретение.ТекущиеДанные;
	Если поле = Элементы.ИА_ЗаказыНаПриобретениеЗПНомер или поле = Элементы.ИА_ЗаказыНаПриобретениеЗППредметЗаказа Тогда
		СтандартнаяОбработка = ложь;
		ПоказатьЗначение(,тд.зп);		
	КонецЕсли;
КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ЕстьБудущееФП(Дата, Организация)
//	
//	Запрос = новый запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	МАКСИМУМ(ИА_ФинансовоеПланирование.Дата) КАК Дата
//	               |ИЗ
//	               |	Документ.ИА_ФинансовоеПланирование КАК ИА_ФинансовоеПланирование
//	               |ГДЕ
//	               |	ИА_ФинансовоеПланирование.Дата >= &Дата
//	               |	И ИА_ФинансовоеПланирование.Проведен
//	               |	И (ИА_ФинансовоеПланирование.Организация = &Организация ИЛИ &ФильтрОрг = ложь)";
//	Запрос.УстановитьПараметр("Дата", дата);
//	Запрос.УстановитьПараметр("Организация", Организация);
//	Запрос.УстановитьПараметр("ФильтрОрг", константы.ИА_ФП_ВестиФППоОрганизациям.Получить());
//	Выборка = запрос.Выполнить().Выбрать();
//	Если выборка.Следующий() Тогда
//		Возврат выборка.дата;
//	Иначе
//		Возврат Неопределено;
//	КонецЕсли;
//	
//КонецФункции
	
&НаКлиенте
Функция НетОшибок()
	//ДатаСлФП = ЕстьБудущееФП(Объект.Дата, Объект.Организация);
	//Если ЗначениеЗаполнено(ДатаСлФП) Тогда
	//	ПоказатьПредупреждение(,"Дата документа должна быть не ранее даты крайнего проведенного ФП для этой организации. Установите дату позднее "+ДатаСлФП+". Если вам необходимо провести документ внедоходного поступления средств ранее крайнего ФП, то сперва отмените проведение ФП, проведите документ с внедоходным поступлением, а затем перепроведите ФП.");
	//	возврат ложь;
	//КонецЕсли;
	
	Если ПоОрг и объект.Организация.Пустая() Тогда
		ПоказатьПредупреждение(,"Выберите Организацию!");
		Отказ = Истина;
		возврат ложь;
	КонецЕсли;
	
	возврат истина;
КонецФункции

//&НаСервереБезКонтекста
//Функция естьБудущиеДоки(организация, дата, ВДПС)
//	Запрос = новый запрос;
//	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |	ИА_СредстваВРезервеНаФондах.Регистратор КАК Регистратор
//	               |ИЗ
//	               |	РегистрНакопления.ИА_СредстваВРезервеНаФондах КАК ИА_СредстваВРезервеНаФондах
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КСУ_ВнедоходноеПоступлениеСредств.ИА_ЗаказыНаПриобретение КАК КСУ_ВнедоходноеПоступлениеСредствИА_ЗаказыНаПриобретение
//	               |		ПО (КСУ_ВнедоходноеПоступлениеСредствИА_ЗаказыНаПриобретение.Ссылка = &ВДПС)
//	               |			И ИА_СредстваВРезервеНаФондах.ЗП = КСУ_ВнедоходноеПоступлениеСредствИА_ЗаказыНаПриобретение.ЗП
//	               |ГДЕ
//	               |	ИА_СредстваВРезервеНаФондах.Период > &Период
//	               |
//	               |ОБЪЕДИНИТЬ
//	               |
//	               |ВЫБРАТЬ
//	               |	ИА_ФинансовоеПланирование.Ссылка
//	               |ИЗ
//	               |	Документ.ИА_ФинансовоеПланирование КАК ИА_ФинансовоеПланирование
//	               |ГДЕ
//	               |	ИА_ФинансовоеПланирование.Проведен
//	               |	И ИА_ФинансовоеПланирование.Дата > &Период
//	               |	И (ИА_ФинансовоеПланирование.Организация = &Организация
//	               |			ИЛИ &ФильтрОрг = ЛОЖЬ)";
//	Запрос.УстановитьПараметр("Организация", Организация);
//	Запрос.УстановитьПараметр("Период", Дата);
//	Запрос.УстановитьПараметр("ВДПС", ВДПС);
//	Запрос.УстановитьПараметр("ФильтрОрг", константы.ИА_ФП_ВестиФППоОрганизациям.Получить());
//	Выборка = запрос.Выполнить().Выбрать();
//	
//	возврат выборка.Следующий();
//КонецФункции

//&НаКлиенте
//Функция НетОшибокПриОтмене()
//	Если естьБудущиеДоки(Объект.организация, Объект.дата, Объект.Ссылка) Тогда
//		парамФ_1 = Новый структура("Период, Организация, ВДПС", объект.Дата, объект.Организация, Объект.Ссылка);
//		ОткрытьФорму("Документ.КСУ_ВнедоходноеПоступлениеСредств.Форма.ПредупреждениеПриОтменеПроведения", парамФ_1, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//		Возврат ложь;
//	КонецЕсли;
//	возврат истина;
//КонецФункции
	
&НаКлиенте
Процедура ПровестиДокумент(Команда)
	если НетОшибок() Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОтменитьПроведение(Команда)
	//если НетОшибокПриОтмене() Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьКнопкиПроведения()	
	Если Элементы.Найти("ФормаПровести") <> Неопределено тогда
		Элементы.ФормаПровести.Видимость = не объект.Проведен;
	КонецЕсли;
	Если Элементы.Найти("ФормаОтменаПроведения") <> Неопределено тогда
		Элементы.ФормаОтменаПроведения.Видимость = объект.Проведен;
	КонецЕсли;
	Если Элементы.Найти("ФормаЗаписать") <> Неопределено тогда
		Элементы.ФормаЗаписать.Видимость = не объект.Проведен;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если объект.Дата > ТекущаяДата() Тогда
		Сообщить("Документ не может быть проведен ""завтрашним числом"". Дата и время проведения документа будут автоматически заменены на текущую дату и время.");
		объект.Дата = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СправкаФонды(Команда)
	ТекстСправки = "<html><head>
                    |<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
                    |<link rel=""stylesheet"" type=""text/css"" href=""v8help://service_book/service_style"">
                    |<base href=""v8config://06d3f688-cb34-4e26-95cb-48939d9dd758/mdobject/id019d5fac-dc28-41a9-baa6-36c66be4907d/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">
                    |</head>
                    |<body>
                    |<div>Перечислите все фонды, в которые нужно напрямую направить средства,&nbsp;</div>
                    |<div>и сумму для зачисления в каждый фонд.&nbsp;</div>
                    |<div><br></div>
                    |<div>Если вы используете ведение финансового планирования в разрезе подразделений,&nbsp;</div>
                    |<div>то средства будут зачислены на конкретный фонд только для указанного подразделения.</div>
                    |
                    |
                    |</body></html>";
	ОткрытьФорму("ОбщаяФорма.КСУ_Справка", новый Структура("ТекстСправки, Заголовок", ТекстСправки, "Внесение средств в фонды"));	
КонецПроцедуры

&НаКлиенте
Процедура СправкаЗаказы(Команда)
	ТекстСправки = "<html><head>
                    |<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
                    |<link rel=""stylesheet"" type=""text/css"" href=""v8help://service_book/service_style"">
                    |<base href=""v8config://06d3f688-cb34-4e26-95cb-48939d9dd758/mdobject/id019d5fac-dc28-41a9-baa6-36c66be4907d/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">
                    |</head>
                    |<body>
                    |<div>
                    |<div>При возврате средств от поставщика вы можете вернуть деньги только на те заказы,&nbsp;</div>
                    |<div>у которых (1) ""Организация"" в заказе и ""Организация"" в документе&nbsp;</div>
                    |<div>""Внедоходное поступление средств"" совпадают, (2) по этим заказам были выплаты.&nbsp;</div>
                    |<div>Явное сравнение названия контрагентов в заказе и в документе ВДПС не проводится.&nbsp;</div>
                    |<div>Будьте внимательны!</div>
                    |<div><br></div>
                    |<div>Деньги будут возвращены на фонды, к которым были привязаны эти заказы,&nbsp;</div>
                    |<div>а на самих заказах сумма ранее выплаченных средств будет уменьшена на&nbsp;</div>
                    |<div>сумму возвращенных денег. Вы сможете снова сделать выплаты по тем же заказам&nbsp;</div>
                    |<div>другим поставщикам. Для подбора заказов для возврата кликните ""плюсик"".&nbsp;</div>
                    |<div>Если вы решили, что часть денег, вернувшихся от поставщика, или все эти деньги&nbsp;</div>
                    |<div>направить не на заказы, в другие фонды, то укажите эти фонды&nbsp;</div>
                    |<div>в разделе ""Внесение средств в фонды"".</div>
                    |<div><br></div>
                    |<div>При добавлении хотя бы одного заказа в список для возврата денег поля для ввода&nbsp;</div>
                    |<div>даты операции, названия организации и типа источника средств блокируются для&nbsp;</div>
                    |<div>редактирования.</div>
                    |<div><br></div>
                    |<div>Если вам необходимо внести изменения в эти поля, удалите все заказы, внесите&nbsp;</div>
                    |<div>изменения в поля и снова сформируйте список заказов для возврата средств.</div></div>
                    |
                    |
                    |</body></html>";
	ОткрытьФорму("ОбщаяФорма.КСУ_Справка", новый Структура("ТекстСправки, Заголовок", ТекстСправки, "Возврат средств на заказы"));	
КонецПроцедуры
